foolish-products/whoaboard_getstarted/hardware/teeonardu/avr/boards.txt
menu.UsbType=USB Type
menu.KeyLayout=Keyboard Layout

WhoaTeensyCore.name=Whoa Board (TeensyCore)
WhoaTeensyCore.build.vid=0x16D0
WhoaTeensyCore.build.pid=0x0CA5 
WhoaTeensyCore.build.board=TEEONARDU_WHOA
WhoaTeensyCore.upload.protocol=avr109
WhoaTeensyCore.upload.maximum_size=28672
WhoaTeensyCore.upload.speed=57600
WhoaTeensyCore.upload.disable_flushing=true
WhoaTeensyCore.upload.use_1200bps_touch=true
WhoaTeensyCore.upload.wait_for_upload_port=true
WhoaTeensyCore.upload.tool=arduino:avrdude
WhoaTeensyCore.bootloader.low_fuses=0xff
WhoaTeensyCore.bootloader.high_fuses=0xd8
WhoaTeensyCore.bootloader.extended_fuses=0xcb
WhoaTeensyCore.bootloader.path=caterina
WhoaTeensyCore.bootloader.file=Caterina-Flora8.hex
WhoaTeensyCore.bootloader.unlock_bits=0x3F
WhoaTeensyCore.bootloader.lock_bits=0x2F
WhoaTeensyCore.bootloader.tool=arduino:avrdude
WhoaTeensyCore.serial.restart_cmd=true
WhoaTeensyCore.serial.safe_baud_rates_only=true
WhoaTeensyCore.build.mcu=atmega32u4
WhoaTeensyCore.build.core=TeeOnArdu
WhoaTeensyCore.build.vid=0x16D0
WhoaTeensyCore.build.pid=0x0CA5 
WhoaTeensyCore.build.f_cpu=8000000L
WhoaTeensyCore.build.variant=whoaboard1
WhoaTeensyCore.build.elide_constructors=true
WhoaTeensyCore.build.cpp0x=true
WhoaTeensyCore.build.dependency=true
WhoaTeensyCore.build.linker_relaxation=true
WhoaTeensyCore.build.serial_number=true
WhoaTeensyCore.menu.UsbType.serial=Serial
WhoaTeensyCore.menu.UsbType.serial.build.define0=-DUSB_SERIAL
WhoaTeensyCore.menu.UsbType.hid=Keyboard + Mouse + Joystick
WhoaTeensyCore.menu.UsbType.hid.build.define0=-DUSB_HID
WhoaTeensyCore.menu.UsbType.hid.fake_serial=teensy_gateway
WhoaTeensyCore.menu.UsbType.serialhid=Serial + Keyboard + Mouse + Joystick
WhoaTeensyCore.menu.UsbType.serialhid.build.define0=-DUSB_SERIAL_HID
WhoaTeensyCore.menu.UsbType.int_disk=Disk(Internal) + Keyboard
WhoaTeensyCore.menu.UsbType.int_disk.build.define0=-DUSB_DISK
WhoaTeensyCore.menu.UsbType.int_disk.fake_serial=teensy_gateway
WhoaTeensyCore.menu.UsbType.int_disk.build.elfpatch=mktinyfat
WhoaTeensyCore.menu.UsbType.sd_disk=Disk(SD Card) + Keyboard
WhoaTeensyCore.menu.UsbType.sd_disk.build.define0=-DUSB_DISK_SDFLASH
WhoaTeensyCore.menu.UsbType.sd_disk.fake_serial=teensy_gateway
WhoaTeensyCore.menu.UsbType.midi=MIDI
WhoaTeensyCore.menu.UsbType.midi.build.define0=-DUSB_MIDI
WhoaTeensyCore.menu.UsbType.midi.fake_serial=teensy_gateway
WhoaTeensyCore.menu.UsbType.rawhid=Raw HID
WhoaTeensyCore.menu.UsbType.rawhid.build.define0=-DUSB_RAWHID
WhoaTeensyCore.menu.UsbType.rawhid.fake_serial=teensy_gateway
WhoaTeensyCore.menu.UsbType.flightsim=Flight Sim Controls
WhoaTeensyCore.menu.UsbType.flightsim.build.define0=-DUSB_FLIGHTSIM
WhoaTeensyCore.menu.UsbType.flightsim.fake_serial=teensy_gateway
WhoaTeensyCore.menu.KeyLayout.en-us=US English
WhoaTeensyCore.menu.KeyLayout.en-us.build.define1=-DLAYOUT_US_ENGLISH
WhoaTeensyCore.menu.KeyLayout.fr-ca=Canadian French
WhoaTeensyCore.menu.KeyLayout.fr-ca.build.define1=-DLAYOUT_CANADIAN_FRENCH
WhoaTeensyCore.menu.KeyLayout.xx-ca=Canadian Multilingual
WhoaTeensyCore.menu.KeyLayout.xx-ca.build.define1=-DLAYOUT_CANADIAN_MULTILINGUAL
WhoaTeensyCore.menu.KeyLayout.da-da=Danish
WhoaTeensyCore.menu.KeyLayout.da-da.build.define1=-DLAYOUT_DANISH
WhoaTeensyCore.menu.KeyLayout.fi-fi=Finnish
WhoaTeensyCore.menu.KeyLayout.fi-fi.build.define1=-DLAYOUT_FINNISH
WhoaTeensyCore.menu.KeyLayout.fr-fr=French
WhoaTeensyCore.menu.KeyLayout.fr-fr.build.define1=-DLAYOUT_FRENCH
WhoaTeensyCore.menu.KeyLayout.fr-be=French Belgian
WhoaTeensyCore.menu.KeyLayout.fr-be.build.define1=-DLAYOUT_FRENCH_BELGIAN
WhoaTeensyCore.menu.KeyLayout.fr-ch=French Swiss
WhoaTeensyCore.menu.KeyLayout.fr-ch.build.define1=-DLAYOUT_FRENCH_SWISS
WhoaTeensyCore.menu.KeyLayout.de-de=German
WhoaTeensyCore.menu.KeyLayout.de-de.build.define1=-DLAYOUT_GERMAN
WhoaTeensyCore.menu.KeyLayout.de-dm=German (Mac)
WhoaTeensyCore.menu.KeyLayout.de-dm.build.define1=-DLAYOUT_GERMAN_MAC
WhoaTeensyCore.menu.KeyLayout.de-ch=German Swiss
WhoaTeensyCore.menu.KeyLayout.de-ch.build.define1=-DLAYOUT_GERMAN_SWISS
WhoaTeensyCore.menu.KeyLayout.is-is=Icelandic
WhoaTeensyCore.menu.KeyLayout.is-is.build.define1=-DLAYOUT_ICELANDIC
WhoaTeensyCore.menu.KeyLayout.en-ie=Irish
WhoaTeensyCore.menu.KeyLayout.en-ie.build.define1=-DLAYOUT_IRISH
WhoaTeensyCore.menu.KeyLayout.it-it=Italian
WhoaTeensyCore.menu.KeyLayout.it-it.build.define1=-DLAYOUT_ITALIAN
WhoaTeensyCore.menu.KeyLayout.no-no=Norwegian
WhoaTeensyCore.menu.KeyLayout.no-no.build.define1=-DLAYOUT_NORWEGIAN
WhoaTeensyCore.menu.KeyLayout.pt-pt=Portuguese
WhoaTeensyCore.menu.KeyLayout.pt-pt.build.define1=-DLAYOUT_PORTUGUESE
WhoaTeensyCore.menu.KeyLayout.pt-br=Portuguese Brazilian
WhoaTeensyCore.menu.KeyLayout.pt-br.build.define1=-DLAYOUT_PORTUGUESE_BRAZILIAN
WhoaTeensyCore.menu.KeyLayout.es-es=Spanish
WhoaTeensyCore.menu.KeyLayout.es-es.build.define1=-DLAYOUT_SPANISH
WhoaTeensyCore.menu.KeyLayout.es-mx=Spanish Latin America
WhoaTeensyCore.menu.KeyLayout.es-mx.build.define1=-DLAYOUT_SPANISH_LATIN_AMERICA
WhoaTeensyCore.menu.KeyLayout.sv-se=Swedish
WhoaTeensyCore.menu.KeyLayout.sv-se.build.define1=-DLAYOUT_SWEDISH
WhoaTeensyCore.menu.KeyLayout.en-gb=United Kingdom
WhoaTeensyCore.menu.KeyLayout.en-gb.build.define1=-DLAYOUT_UNITED_KINGDOM
WhoaTeensyCore.menu.KeyLayout.usint=US International
WhoaTeensyCore.menu.KeyLayout.usint.build.define1=-DLAYOUT_US_INTERNATIONAL

